vegeta-cli/src/vegeta/aeromant/templates/aircraft_rotor_disks/org/constant/fvModels
/*--------------------------------*- C++ -*----------------------------------*\
  Aeromant template case (OpenFOAM.org dialect) — values in {{...}} are inserted by aeromant.prepare()
  Two propellers as rotor disks (blade-element source terms): the blade geometry and the section polar
  come from Boreas (radius [m], twist [deg], chord [m]; alpha [deg], Cd, Cl). Thrust is along "axis".
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvModels;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

diskLeft
{
    type            rotorDisk;
    libs            ("librotorDisk.so");
    cellZone        diskLeft;

    nBlades         {{BLADES}};
    tipEffect       {{TIP_EFFECT}};
    inletFlowType   local;
    inletVelocity   ({{INLET_VELOCITY}});
    geometryMode    specified;
    origin          ({{DISK1_CENTER}});
    axis            ({{DISK_AXIS}});
    refDirection    ({{REF_DIRECTION}});
    omega           {{DISK1_RPM}} [rpm];
    trimModel       fixedTrim;
    rhoRef          {{DENSITY}};
    rhoInf          {{DENSITY}};

    fixedTrim
    {
        theta0      0;
        theta1c     0;
        theta1s     0;
    }
    flap
    {
        beta0       0;
        beta1c      0;
        beta2s      0;
    }
    blade
    {
        data
        (
{{BLADE_DATA}}
        );
    }
    profiles
    {
        section
        {
            type    lookup;
            data
            (
{{PROFILE_DATA}}
            );
        }
    }
}

diskRight
{
    type            rotorDisk;
    libs            ("librotorDisk.so");
    cellZone        diskRight;

    nBlades         {{BLADES}};
    tipEffect       {{TIP_EFFECT}};
    inletFlowType   local;
    inletVelocity   ({{INLET_VELOCITY}});
    geometryMode    specified;
    origin          ({{DISK2_CENTER}});
    axis            ({{DISK_AXIS}});
    refDirection    ({{REF_DIRECTION}});
    omega           {{DISK2_RPM}} [rpm];
    trimModel       fixedTrim;
    rhoRef          {{DENSITY}};
    rhoInf          {{DENSITY}};

    fixedTrim
    {
        theta0      0;
        theta1c     0;
        theta1s     0;
    }
    flap
    {
        beta0       0;
        beta1c      0;
        beta2s      0;
    }
    blade
    {
        data
        (
{{BLADE_DATA}}
        );
    }
    profiles
    {
        section
        {
            type    lookup;
            data
            (
{{PROFILE_DATA}}
            );
        }
    }
}

// ************************************************************************* //
